import type { Metadata } from 'next';

import { Game } from './_ui';

export const metadata: Metadata = {
  title: 'Sudoku',
  description:
    'Судоку - логічна японська головоломка з числами.' +
    ' Ігрове поле складається з квадрата, розміром 9x9, розділеного на менші квадрати із стороною 3x3 клітинки.' +
    ' Таким чином, все поле налічує 81 клітинку.' +
    ' Мета головоломки - необхідно заповнити вільні клітинки цифрами від 1 до 9 так, щоб в кожному рядку,' +
    ' в кожному стовпці і в кожному малому квадраті 3x3, кожна цифра зустрічалася лише один раз.',
};

export default function SudokuPage() {
  return <Game />;
}
